# 2.จงเขียนโมดูลขึ้นมาแล้วบันทึกไฟล์ชื่อว่า my_input.py ประกอบไปด้วยฟังก์ชัน get() ที่จะทำหน้าที่คอยรับข้อมูลเลขจำนวนเต็มในช่วงของพารามิเตอร์ที่ส่งมาให้
# เช่น รับพารามิเตอร์จากเป็น 1 และ 10 ก็จะทำการวนลูปรับข้อมูลเลขจำนวนเต็มที่มีค่าตั้งแต่ 1 ถึง 10 เท่านั้น
# ถ้าไม่อยู่ในช่วงก็จะวนลูปรับข้อมูลจนกว่าจะได้ข้อมูลที่ต้องการตามช่วงที่กำหนด
# และเขียนโปรแกรมหลักในไฟล์ชื่อว่า import_my_input.py ซึ่งจะ import โมดูล my_input เข้ามา
# เรียกใช้ฟังก์ชันตรวจช่วงของข้อมูลเลขจำนวนเต็มตามช่วง คือกรณีแรก กำหนดค่าต่ำสุด 1 และค่าสูงสุดคือ 10
# และกรณีที่ 2 ให้ค่าต่ำสุดคือ 100 และค่าสูงสุดคือ 999 ดังตัวอย่างการรันโปรแกรม

# ครั้งที่ 1
# Enter a number (1–10): -5  
# Invalid Input!!!  
# Enter a number (1–10): 20  
# Invalid Input!!!  
# Enter a number (1–10): 7  
# You entered number 7

# ครั้งที่ 2
# Enter a number (100–999): 30  
# Invalid Input!!!  
# Enter a number (100–999): 1500  
# Invalid Input!!!  
# Enter a number (100–999): 567  
# You entered number 567
