# 1.จงเขียนโมดูลขึ้นมาแล้วบันทึกไฟล์ชื่อว่า my_avg.py ประกอบไปด้วยฟังก์ชัน avg() ที่จะรับพารามิเตอร์รายการ 1 ตัว 
# ที่เป็นลิสต์หรือตูเพิล แล้วจะทำการหาผลรวมค่าคะแนนเพื่อหาค่าเฉลี่ย
# และเขียนโปรแกรมหลักในไฟล์ชื่อว่า import_my_avg.py ซึ่งจะ import โมดูลที่ชื่อว่า my_avg เข้ามา
# แล้วกำหนดตัวแปรเก็บข้อมูลลิสต์ l = [3,7,4,5,9,2,1] และตัวแปรตูเพิล t = (1,9,2,8)
# แล้วนำแต่ละตัวแปรไปหาค่าเฉลี่ยของข้อมูลทั้ง 2 ออกทางจอภาพโดยเรียกใช้โมดูล my_avg ดังตัวอย่างการรันโปรแกรม

# The average of list 'l' is 4.43  
# The average of tuple 't' is 5.00
