# 1.จงเขียนโปรแกรมโดยใช้ลูป for เขียนข้อมูลเลขจำนวนเต็ม 1 ถึง 100 ถ้าเลขไม่ครบ 3 หลักให้ใส่เลข 0 ด้านหน้าให้ครบ 3 หลัก
# โดยเขียนบรรทัดละ 10 ตัว แต่ละตัวจะถูกคั่นด้วยช่องว่าง 1 ช่อง ลงในไฟล์ number.txt ดังแสดงในรูปที่ 10.1

# ตัวอย่างผลลัพธ์ในไฟล์ number.txt
# 001 002 003 004 005 006 007 008 009 010
# 011 012 013 014 015 016 017 018 019 020
# 021 022 023 024 025 026 027 028 029 030
# 031 032 033 034 035 036 037 038 039 040
# 041 042 043 044 045 046 047 048 049 050
# 051 052 053 054 055 056 057 058 059 060
# 061 062 063 064 065 066 067 068 069 070
# 071 072 073 074 075 076 077 078 079 080
# 081 082 083 084 085 086 087 088 089 090
# 091 092 093 094 095 096 097 098 099 100

with open("number.txt", "w") as f:
    for i in range(1, 101):
        f.write(f"{i:03} ")
        if i % 10 == 0:
            f.write("\n")
