# 4.จงเขียนโมดูลขึ้นมาแล้วบันทึกไฟล์ชื่อว่า my_low_up_string.py ประกอบไปด้วยคลาสที่ชื่อว่า Low_Up_String ซึ่งมีเมธอด lower 
# จะรับข้อมูลสตริง แล้วแสดงสตริงที่เป็นตัวพิมพ์เล็กทั้งหมดออกที่จอภาพ
# และเมธอด upper จะรับข้อมูลสตริง แล้วแสดงสตริงที่เป็นตัวพิมพ์ใหญ่ทั้งหมดออกที่จอภาพ
# และเขียนโปรแกรมในไฟล์ชื่อว่า import_my_low_up_string.py ซึ่งจะ import โมดูล my_low_up_string เข้ามา
# ตัวโปรแกรมจะทำการรับข้อมูลสตริง แล้วเรียกใช้เมธอด lower และ upper โดยส่งสตริงนั้น ดังตัวอย่างการรันโปรแกรม

# Enter a string: I Love SUT  
# i love sut  
# I LOVE SUT
