# 3.จงเขียนโมดูลขึ้นมาแล้วบันทึกไฟล์ชื่อว่า my_factorial.py ประกอบไปด้วยคลาสชื่อว่า Fac ซึ่งมีเมธอด 2 เมธอดคือ
# เมธอด loop จะรับข้อมูลเลขจำนวนเต็ม ประมวลผลหาค่าแฟกทอเรียลโดยใช้ลูป for แล้วแสดงผลลัพธ์กลับ
# และเมธอด recursive จะรับข้อมูลเลขจำนวนเต็ม ประมวลผลหาค่าแฟกทอเรียลโดยใช้การวนซ้ำ (recursive)
# แล้วส่งผลลัพธ์กลับเช่น เมธอดทั้ง 2 รับเลขจำนวนเต็ม 5 เข้ามา ก็แสดงผลออกคือ 5*4*3*2*1 แล้วส่งผลลัพธืที่ได้คือ 120 กลับ เป็นต้น
# และเขียนโปรแกรมบันทึกไฟล์ชื่อว่า import_my_factorial.py ซึ่งจะ import โมดูล my_factorial เข้ามา
# ตัวโปรแกรมจะทำการวนลูปรับข้อมูลเลขจำนวนเต็มที่มีค่าตั้งแต่ 1 ถึง 100 เท่านั้น ถ้าไม่อยู่ในพิสัยจะแสดงข้อความ Invalid Input!!!
# แล้ววนลูปรับข้อมูลใหม่จนกว่าจะได้ข้อมูลที่ต้องการแล้วเรียกใช้เมธอด loop และ recursive ในคลาส Fac 
# โดยส่งเลขจำนวนเต็มนั้นไป ดังตัวอย่างการรันโปรแกรม

# Enter a number (1–100): –20  
# Invalid Input!!!  
# Enter a number (1–100): 300  
# Invalid Input!!!  
# Enter a number (1–100): 5  
# Calculate Factorial Using Loop  
# 5! = 5*4*3*2*1  
# 5! = 120  
# Calculate Factorial Using Recursion  
# 5! = 5*4*3*2*1  
# 5! = 120

