# การควบคุมแบบทางแยก (Branching)
# 1. จงเขียนโปรแกรมในการรับเลขจำนวนเต็ม 1 จำนวน แล้วทำการตรวจสอบว่าเลขที่รับมานั้น มีค่า
# มากกว่า น้อยกว่า หรือเท่ากับ เลขจำนวนเต็ม 555 แล้วแสดงผลออกที่จอภาพ ดังตัวอย่างการรัน
# โปรแกรม
# ตัวอย่างการรันโปรแกรมครั้งที่ 1
# Enter a number 555: 999
# 999 is bigger than 555
# ตัวอย่างการรันโปรแกรมครั้งที่ 2
# Enter a number 555: 123
# 123 is smaller than 555
# ตัวอย่างการรันโปรแกรมครั้งที่ 3
# Enter a number 555: 555
# 555 is equal to 555

# n = int(input('Enter a number 555: '))
# if n > 555:
#  print('%d is bigger than 555' % n)
# elif n < 555:
#  print('%d is smaller than 555' % n)
# else:
#  print('%d is equal to 555' % n)

#==================================================================

# 2.การควบคุมแบบวนลูป (Looping)
# 2. จงเขียนโปรแกรมในการรับเลขจำนวนเต็มที่เป็นเลขคี่ 1 จำนวน เพื่อพิมพ์เลขจำนวนนั้นมาจนถึง 1
# พร้อมกับบอกผลรวมของเลขเหล่านั้นออกที่จอภาพ ดังตัวอย่างการรันโปรแกรม
# ตัวอย่างการรันโปรแกรม
# Enter odd number: 11
# 11 9 7 5 3 1
# Total = 36

# n = int(input('Enter odd number: '))
# total = 0
# for i in range(n, 0, -2):
#  print(i, end = ' ')
#  total += i
# print('\nTotal =',total)

#==================================================================

# 3.คำสั่งพิเศษในการควบคุม (Special Control)
# 3. จงเขียนโปรแกรมโดยใช้ลูปในการพิมพ์ตัวเลขจำนวนเต็มจาก 1 ถึง 30 ออกที่จอภาพ พร้อมนับ
# จำนวนรอบ และแสดงผลออกที่จอภาพ ดังตัวอย่างการรันโปรแกรม โดยมีเงื่อนไขดังต่อไปนี้
# - ถ้าเป็นตัวเลข 10 20 และ 30 ให้ขึ้นบรรทัดใหม่ และยกเลิกการทำงานส่วนที่เหลือในลูป โดยใช้
# คำสั่ง continue
# - ถ้าเป็นตัวเลข 11 และ 22 ไม่ต้องมีการประมวลผลใดๆ (ไม่ต้องแสดงผล) โดยใช้คำสั่ง pass
# - ถ้าเป็นตัวเลข 25 ให้หลุดออกจากลูป โดยใช้คำสั่ง break
# ตัวอย่างการรันโปรแกรม
# 1 2 3 4 5 6 7 8 9
# 12 13 14 15 16 17 18 19
# 21 23 24
# Round = 22

# round = 0
# for i in range(1,31):
#     if i%10 == 0:
#         print()
#         continue
#     elif i%11 == 0:
#         pass
#     elif i == 25:
#         break
#     else:
#         print(i, end = ' ')
#     round += 1
# print('\nRound =', round)

#==================================================================

# โจทย์พิเศษ
# 4. จงเขียนโปรแกรมเพื่อใช้ลูปซ้อนลูป (Nested Loops) แสดงแถวและคอลัมน์1 ถึง 5 ออกที่
# จอภาพ ดังตัวอย่างการรันโปรแกรม
# ตัวอย่างการรันโปรแกรม
# 1:1 1:2 1:3 1:4 1:5
# 2:1 2:2 2:3 2:4 2:5
# 3:1 3:2 3:3 3:4 3:5
# 4:1 4:2 4:3 4:4 4:5
# 5:1 5:2 5:3 5:4 5:5

for row in range(1,6):
    for col in range(1,6):
        print('%d:%d' % (row, col), end = ' ')
    print()