# 1.การรับชุดข้อมูลโดยใช้เมธอด .split()
# 1. จงเขียนโปรแกรมในการรับชุดข้อมูลที่เป็นสตริง 4 ตัว เป็นชื่อผลไม้เข้ามาเก็บไว้ที่ตัวแปร s แต่ละ
# ตัวจะคั่นด้วยช่องว่าง 1 ช่อง นำข้อมูลนั้นเก็บเป็นลิสต์ไว้ที่ตัวแปร f แล้วแสดงออกที่จอภาพ
# ดังตัวอย่างการรันโปรแกรม
# ตัวอย่างการรันโปรแกรม
# Enter 4 fruits separated by spaces: apple banana coconut durian
# Fruits in list: ['apple', 'banana', 'coconut', 'durian']

# s = input('Enter 4 fruits separated by spaces: ')
# f = s.split(' ')
# print('Fruits in list:',f)

#==================================================================

# 2.❑ การแปลงชนิดของชุดข้อมูลโดยใช้ฟังก์ชัน map()
# 2. จงเขียนโปรแกรมในการรับข้อมูลสตริงที่เป็นวัน เดือน ปีคั่นด้วยเครื่องหมาย / เข้ามาเก็บไว้ที่
# ตัวแปร d แล้วแปลงข้อมูลในตัวแปร d ให้เป็นทูเพิลโดยใช้ฟังก์ชัน map() ไว้ที่ตัวแปร tu
# แล้วแสดงออกที่จอภาพ ดังตัวอย่างการรันโปรแกรม
# ตัวอย่างการรันโปรแกรม
# Enter date: 25/07/2024
# Data in tuple: (25, 7, 2024)

# d = input('Enter date: ')
# tu = tuple(map(int,d.split('/')))
# print('Data in tuple:',tu)

#==================================================================

# 3.❑ การแสดงผลข้อมูลโดยใช้เมธอด .format()
# 3. จงเขียนโปรแกรมในการกำหนดข้อมูลให้ตัวแปร name = ‘Mana’ ตัวแปร sex = ‘M’ ตัวแปร
# number = 123 และตัวแปร gpa = 3.25 แล้วแสดงผลของตัวแปรเหล่านั้นออกที่จอภาพโดยใช้
# เมธอด .format() จัดตำแหน่งให้ตรงกับชื่อหัวข้อ (ชิดซ้าย ชิดขวา หรือตรงกลาง) ดังตัวอย่างการ
# รันโปรแกรม
# ตัวอย่างการรันโปรแกรม
# 1234567890123456789012345678901234567890
# NAME SEX NUMBER GPA
# MR.Mana M 123 3.2500

name = 'Mana'
sex = 'M'
number = 123
gpa = 3.25
print('1234567890123456789012345678901234567890')
print('{:15}{:3}{:>12}{:>10}'.format('NAME','SEX','NUMBER','GPA'))
print('MR.{:13}{:2}{:>12}{:>10,.4f}'.format(name,sex,number,gpa))